RIET/src/Tasks/МестоположениеПоставки/МестоположениеПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>МестоположениеПоставки</name>
  <addressing>InformationRegister.ОператорыДляУведомлений</addressing>
  <attributes>
    <name>Trip</name>
    <type>
      <types>DocumentRef.TripNonLawsonCompanies</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Местоположение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяМестоположения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Critical</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериодаНотификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериодаНотификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>FS_History</name>
    <attributes>
      <name>Местоположение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяМестоположения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>Координатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

RIET/src/Tasks/МестоположениеПоставки/ManagerModule.bsl
Функция ПолучитьГеолокациюТрипа(Трип) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МестоположениеПоставки.Местоположение,
	|	МестоположениеПоставки.ВремяМестоположения,
	|	МестоположениеПоставки.Описание
	|ИЗ
	|	Задача.МестоположениеПоставки КАК МестоположениеПоставки
	|ГДЕ
	|	МестоположениеПоставки.Trip = &Trip
	|	И НЕ МестоположениеПоставки.Выполнена
	|	И МестоположениеПоставки.Местоположение <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	МестоположениеПоставки.Дата УБЫВ";
	Запрос.УстановитьПараметр("Trip", Трип);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Количество() > 0 Тогда
		Результат.Следующий();
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
